Repository: MohnadSaadeh/al-ard-library
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Failed to add currency: %(err)s
ar: فشل إضافة العملة: %(err)s

source: All exchange rate fields are required.
ar: جميع الحقول مطلوبة

source: Exchange rate must be greater than 0.
ar: يجب أن يكون سعر الصرف أكبر من 0.

source: Exchange rate added successfully.
ar: تم إضافة سعر الصرف بنجاح.

source: Exchange rate updated successfully.
ar: تم تحديث سعر صرف العملة بنجاح.

source: One or both currencies not found.
ar: إحدى العملتين أو كلتاهما غير موجودة.

source: Exchange rate must be a valid number.
ar: يجب إدخال قيمة رقمية صحيحة لسعر الصرف.

source: Failed to add exchange rate: %(err)s
ar: تعذّرت إضافة سعر الصرف: %(err)s

source: Rate ID and value are required.
ar: يجب إدخال معرّف السعر وقيمته.

source: Exchange rate not found.
ar: تعذّر العثور على سعر الصرف.

source: Failed to update exchange rate: %(err)s
ar: تعذّر تحديث سعر الصرف: %(err)s

source: Rate ID is required.
ar: يجب إدخال معرّف السعر.

source: Exchange rate deleted successfully.
ar: تم حذف سعر الصرف بنجاح

source: Failed to delete exchange rate: %(err)s
ar: تعذّر حذف سعر الصرف: %(err)s

source: View Sale Order
ar: عرض طلبات المبيعات

source: No products found in this sale order.
ar: لا توجد منتجات لهذا الإرجاع.

source: Product created successfully!
ar: تم الشراء بنجاح

source: Please select an Excel file to upload.
ar: يرجى اختيار ملف إكسل لتحميله.

source: Please upload a valid Excel file (.xlsx).
ar: يرجى تحميل ملف Excel صالح (.xlsx).

source: Row %(row_num)d: Missing required fields (product_name)
ar: سطر %(row_num)d: حقل ضروري مفقود (product_name)

source: Row %(row_num)d: Invalid production_date format (use YYYY-MM-DD, YYYY, or other common formats)
ar: سطر %(row_num)d: تاريخ انتاج غير صالح (use YYYY-MM-DD, YYYY, او اي تنسيق اخر)

source: Row %(row_num)d: Invalid purchasing_price
ar: سطر %(row_num)d: سعر الشراء غير صالح

source: Row %(row_num)d: Invalid sale_price
ar: سطر %(row_num)d: سعر البيع غير صالح

source: Row %(row_num)d: Product with ISBN '%(isbn)s' already exists
ar: سطر %(row_num)d ISBN المنتج '%(isbn)s' موجود مسبقا

source: Row %(row_num)d: %(error)s
ar: سطر %(row_num)d: %(error)s

source: Import failed due to errors in the Excel file. Please fix the following issues and try again:
ar: فشلت عملية , يرجى تصحيح المشكلات التالية ثم المحاولة مرة أخرى:

source: Successfully imported %(count)d products.
ar: تم بنجاح استيراد %(count)d منتج.

source: Error processing Excel file: %(error)s
ar: حدث خطأ أثناء معالجة ملف Excel: %(error)s

source: Row %(row)d: Missing required fields
ar: سطر %(row)d: حقل ضروري مفقود (product_name)

source: Row %(row)d: Invalid quantity or unit_price
ar: سطر %(row)d:الكمية او سعر الشراء غير صالح

source: Row %(row)d: Product name '%(pname)s' does not match '%(expected)s'
ar: السطر %(row_num)d: اسم الكتاب '%(pname)s' لا يتطابق مع الاسم '%(expected)s' للرقم ISBN '%(isbn)s'

source: Row %(row)d: Product with ISBN '%(isbn)s' not found
ar: سطر %(row)d ISBN المنتج '%(isbn)s'غير موجود

source: Row %(row)d: Currency '%(currency)s' not found
ar: سطر %(row)d ISBN المنتج '%(isbn)s'غير موجود

source: Row %(row)d: Employee with ID '%(id)s' not found
ar: السطر %(row)d: الموظف ذو المعرّف '%(id)s' غير موجود

source: Row %(row)d: %(error)s
ar: سطر %(row)d: %(error)s

source: Import failed due to errors in the Excel file. Please fix and try again:
ar: فشلت عملية , يرجى تصحيح المشكلات التالية ثم المحاولة مرة أخرى:

source: Error creating invoice for %(key)s: %(error)s
ar: حدث خطأ أثناء انشاء الفاتورة %(key)s: %(error)s

source: Successfully imported %(invoices)d purchase invoices with %(items)d items.
ar: تم استيراد %(invoices)d فواتير شراء بنجاح، بإجمالي %(items)d عناصر.

source: Remaining Quantity
ar: كمية المتبقية

source: Money Should Received
ar: الاموال المستلمة

source: Product "%(prod)s" is out of stock.
ar: لا يمكن بيع "%(prod)s": فارغ من المخزون.

source: Not enough stock for product "%(prod)s". Available: %(avail)d
ar: لا يوجد مخزون كافٍ للكتاب "%(prod)s". المتاح: %(avail)d

source: Please add at least one product to stock-out voucher!
ar: ادخل كتاب على الاقل للشراء

source: Please select a customer for the stock-out voucher!
ar: يرجى تحديد عميل قبل إنشاء سند المخرجات!

source: You must be signed in as an employee.
ar: يجب أن تكون مسجّل الدخول كموظف.

source: Stock-Out Voucher Created Successfully!
ar: تم إنشاء سند مخرجات بنجاح!

source: Product and positive quantity are required.
ar: الكتاب والكمية مطلوبان !

source: Product not found.
ar: الكتاب غير موجود

source: Item quantity updated.
ar: تم تحديث الكمية

source: Item added.
ar: تمت اضافة العنصر

source: Item not found.
ar: العنصر غير موجود

source: Item deleted.
ar: تم حذف

source: Voucher not found
ar: سند غير موجود

source: Invalid item_id
ar: معرف العنصر غير صالح

source: Item not found
ar: لم يتم العثور على العنصر

source: Cannot convert an empty voucher. Please add items first.
ar: لا يمكن تحويل قسيمة فارغة. يرجى إضافة الكتب أولاً.

source: Item "%(prod)s" has non-positive quantity.
ar: العنصر "%(prod)s" يحتوي على كمية غير صحيحة (يجب أن تكون موجبة).

source: Not enough stock for "%(prod)s". Available: %(avail)d, required: %(req)d
ar: لا يمكن بيع كمية أكبر من المخزون المتاح للمنتج "%(prod)s". المتاح: %(available)d، الكمية المطلوبة الإجمالية: %(total)d

source: Converted to sale invoice successfully.
ar: تم تحويل المستند إلى فاتورة مبيعات بنجاح.
