Repository: MohnadSaadeh/al-ard-library
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Product Name
ar: اسم الكتاب

source: Quantity
ar: الكمية

source: Purchasing Price
ar: سعر الشراء

source: Sale Price
ar: سعر البيع

source: Supplier
ar: المورد

source: Publisher
ar: الناشر

source: Production Date
ar: تاريخ النشر

source: Category
ar: التصنيف

source: Author
ar: المؤلف

source: Expiry Date
ar: تاريخ الانتهاء

source: Attribute Name
ar: اسم الخاصية

source: Value Type
ar: نوع البيانات

source: Attribute Value
ar: قيمة الخاصية

source: Enter the attribute name.
ar: ادخل العنوان هنا

source: Select the value type.
ar: نوع البيانات المدخلة

source: Enter the value for this attribute.
ar: اخل القيمة الخاصة بعنوان الخاصية الاضافية

source: Cash
ar: نـقـد

source: Debts
ar: ذمــم

source: About Us
ar: من نحن

source: Our Team
ar: فريقنا

source: Mohannad Saadeh
ar: مهند سعادة

source: The way to manage your stock, STOCKSYNC
ar: الطريقة لإدارة مخزونك، ستوك سينك

source: All the features you'll ever need to manage your business
ar: كل الميزات التي ستحتاجها لإدارة عملك

source: Change Password
ar: تغيير كلمة المرور

source: Old Password
ar: كلمة المرور القديمة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Back to Dashboard
ar: العودة الى لوحة التحكم

source: Company Profile
ar: ملف تعريف الشركة

source: Company Name
ar: اسم الشركة

source: Registration Number
ar: رقم التسجيل

source: Address (optional)
ar: العنوان (اختياري)

source: Phone (optional)
ar: الهاتف (اختياري)

source: Email (optional)
ar: البريد الالكتروني (اختياري)

source: Base Currency
ar: العملة الاساسية

source: Select a currency
ar: اختار العملة

source: Cancel
ar: إلغاء

source: Save Company Profile
ar: حفظ ملف تعريف الشركة

source: Manage Currencies
ar: ادارة العملات

source: Currency Code (e.g., USD, EUR, ILS)
ar: رمز العملة

source: Currency Name
ar: اسم العملة

source: Add Currency
ar: اضافة عملة

source: Code
ar: رمز

source: Name
ar: الاسم

source: No currencies added yet
ar: لا يوجد عملات مضافة بعد

source: Manage Exchange Rates
ar: إدارة أسعار الصرف

source: From Currency
ar: من العملة

source: Select currency
ar: اختر العملة

source: To Currency
ar: إلى العملة

source: Exchange Rate
ar: سعر الصرف

source: Add/Update Rate
ar: إضافة/تحديث السعر

source: From
ar: من

source: To
ar: الى

source: Rate
ar: النسبة

source: Date
ar: تاريخ

source: Actions
ar: إجراءات

source: Edit
ar: تعديل

source: Are you sure?
ar: هل انت متأكد ؟

source: Delete
ar: حذف

source: No exchange rates added yet
ar: لم يتم اضافةاسعار صرف بعد

source: Edit Exchange Rate
ar: تعديل اسعار الصرف

source: Save Changes
ar: حفظ التغييرات

source: Customer
ar: العميل

source: Phone:
ar: الهاتف:

source: Email:
ar: البريد الإلكتروني:

source: Edit Customer
ar: تعديل بيانات العميل

source: Back to list
ar: الرجوع للقائمة

source: Sales Orders for this customer
ar: طلبات المبيعات لهذا العميل

source: No.
ar: رقم

source: Order Type
ar: نوع السند

source: Added by
ar: أضيف بواسطة

source: Total
ar: الإجمالي

source: Action
ar: إجراء

source: Sale Order
ar: سند مبيعات

source: View
ar: عرض

source: Stock Out Order
ar: طلب مخرجات

source: No sales orders found for this customer.
ar: لا توجد مبيعات لهذا العميل

source: Customers
ar: العملاء

source: Manage your customers
ar: ادارة العملاء

source: Search customers
ar: بحث عن عميل

source: Search
ar: بحث

source: Add Customer
ar: اضافة عميل

source: Contact Info:
ar: معلومات التواصل

source: No contact info
ar: لا معلومات للتواصل

source: Are you sure you want to delete this customer?
ar: هل انت متأكد من حذف العميل

source: No customers found.
ar: لا يوجد عملاء

source: Phone
ar: الهاتف:

source: Email
ar: البريد الإلكتروني

source: Contact Info
ar: تفاصيل التواصل

source: Close
ar: اغلاق

source: Save Customer
ar: حفظ العميل

source: Edit Product
ar: تعديل المنتج

source: Product Information
ar: معلومات المنتج

source: Employee Reports
ar: تقارير الموظفين

source: Reports
ar: التقارير

source: Al Ard / Daily Report
ar: مكتبة الارض / التقرير اليومي

source: Date:
ar: تاريخ

source: Stock Products Report
ar: تقرير الموجودات

source: Empty Products Report
ar: تقرير النواقص

source: Sales Report
ar: تقرير المبيعات

source: Sort Report
ar: تقرير تصنيفات

source: Download Excel
ar: تحميل ملف إكسل

source: AL Ard
ar: الأرض

source: Bad Request
ar: اجراء خاطئ

source: The server could not understand your request. Please check and try again.
ar: لم يتمكن الخادم من فهم طلبك. يرجى التحقق والمحاولة مرة أخرى.

source: You do not have permission to access this page.
ar: ليس لديك إذن بالوصول إلى هذه الصفحة.

source: Sign In
ar: تسجيل الدخول

source: 404 Not Found
ar: غير موجود 404

source: Page Not Found
ar: هذه الصفحة غير موجودة

source: The page you are looking for does not exist or has been moved.
ar: الصفحة التي تبحث عنها غير موجودة

source: 500 Server Error
ar: خطأ في الخادم

source: Internal Error
ar: خطأ داخلي

source: Something went wrong. Please try again later or contact support.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى لاحقًا أو الاتصال بالدعم

source: Forget Password
ar: نسيت كلمة المرور

source: Send Reset Link
ar: إرسال رابط إعادة التعيين

source: Back to Sign In
ar: العودة إلى صفحة تسجيل الدخول

source: Employee Dashboard
ar: لوحة تحكم الموظف

source: Main Page
ar: الصفحة الرئيسية

source: Dashboard Manage
ar: لوحة الإدارة

source: Sales Orders
ar: سند مبيعات

source: Return Sales
ar: سند مردودات مبيعات

source: Purchase Invoices
ar: سند مشتريات

source: Return Purchases
ar: سند مردود مشتريات

source: Stock Out Voucher
ar: سند اخراج

source: Product List
ar: قائمة المنتجات

source: Suppliers
ar: الموردون

source: Company Settings
ar: إعدادات الشركة

source: Employees
ar: الموظفون

source: Logout
ar: تسجيل الخروج

source: Argon Configurator
ar: مُهيئ أرجون

source: See our dashboard options.
ar: استعرض خيارات لوحة التحكم.

source: Sidebar Colors
ar: ألوان الشريط الجانبي

source: Sidenav Type
ar: نوع الشريط الجانبي

source: Choose between 2 different sidenav types.
ar: اختر بين نوعين مختلفين من الأشرطة الجانبية.

source: White
ar: فاتح

source: Dark
ar: داكن

source: You can change the sidenav type just on desktop view.
ar: يمكنك تغيير نوع الشريط الجانبي في عرض سطح المكتب فقط.

source: Navbar Fixed
ar: تثبيت شريط التنقل

source: Light / Dark
ar: فاتح / داكن

source: Free Download
ar: تحميل مجاني

source: View documentation
ar: عرض التوثيق

source: made with
ar: صُنع بـ

source: by
ar: بواسطة

source: Member Mate
ar: ميمبر ميت

source: StockSync
ar: ستوك سينك

source: WhatsApp
ar: واتساب

source: Dashboard
ar: لوحة التحكم

source: English
ar: الإنجليزية

source: this return form
ar: نموذج الإرجاع هذا

source: Open return form for
ar: فتح نموذج الإرجاع لـ

source: Manager Dashboard
ar: تحكم الادارة

source: Today's Sales Orders
ar: طيبات البيع الوم

source: Today's Purchase Orders
ar: طلبا الشراء من الموردين اليوم

source: Out of stock products
ar: فارغ من المخرون

source: Near Expiry products
ar: شارف على الانتهاء

source: Sales overview
ar: نظرة عامة على المبيعات

source: Define Book's
ar: تعريف الكتب

source: Pages
ar: الصفحات

source: Confirm Return
ar: تأكيد الإرجاع

source: Are you sure you want to open the return form?
ar: هل أنت متأكد أنك تريد فتح نموذج الإرجاع؟

source: Open
ar: فتح

source: Document
ar: مستند

source: Purchase Invoice
ar: فاتورة شراء

source: (none)
ar: لا يوجد

source: Invoice No:
ar: رقم الفاتورة:

source: Currency:
ar: العملة

source: Reg. No:
ar: رقم التسجيل:

source: Product
ar: المنتج

source: Qty
ar: الكمية

source: Unit Price
ar: سعر الوحدة

source: Total (Base)
ar: الإجمالي

source: No products for this purchase.
ar: لا توجد منتجات لهذا الإرجاع.

source: Grand Total
ar: الإجمالي الكلي

source: VAT / Tax No:
ar: رقم الضريبة / ضريبة القيمة المضافة:

source: Payment Terms:
ar: شروط الدفع:

source: Authorized Signature
ar: التوقيع المعتمد

source: Received by (Supplier)
ar: استلم بواسطة (العميل)

source: Return Invoice
ar: فاتورة إرجاع

source: Returned Products Invoice
ar: فاتورة مرجعات مشتريات

source: No returned products recorded for this invoice.
ar: لا توجد منتجات لهذا الإرجاع.

source: Sale Return Invoice
ar: فاتورة مردودات مبيعات

source: No products for this return.
ar: لا توجد منتجات لهذا الإرجاع.

source: Received by (Customer)
ar: استلم بواسطة (العميل)

source: Sales Invoice
ar: فاتورة مبيعات

source: Total Price
ar: السعر الإجمالي

source: Voucher No:
ar: رقم الفاتورة:

source: Import Products from Excel
ar: استيراد المنتجات من Excel

source: Excel File Format Requirements:
ar: متطلبات تنسيق ملف إكسل:

source: Your Excel file should have the following columns in order:
ar: يجب أن يحتوي ملف Excel الخاص بك على الأعمدة التالية بالترتيب:

source: Required
ar: مطلوب

source: Optional (default: 0)
ar: اختياري (الافتراضي: 0)

source: Optional
ar: اختياري

source: Required, must be unique
ar: مطلوب، ويجب أن يكون فريدًا

source: Optional (various formats accepted: YYYY-MM-DD, YYYY, MM/DD/YYYY, etc.)
ar: اختياري (يتم قبول تنسيقات مختلفة: YYYY-MM-DD، YYYY، MM/DD/YYYY، إلخ.)

source: Note:
ar: ملحوظة:

source: The first row should be headers and will be skipped during import.
ar: يجب أن يكون الصف الأول عبارة عن عناوين وسيتم تخطيه أثناء الاستيراد.

source: Select Excel File (.xlsx)
ar: حدد ملف إكسل (.xlsx)

source: Only .xlsx files are supported.
ar: . فقط xlsx يتم دعم ملفات

source: if error appears in any product, means that this product have not been imported.
ar: إذا ظهر خطأ في أي منتج، فهذا يعني أن هذا المنتج لم يتم استيراده.

source: Import Products
ar: استيراد المنتجات

source: Back to Products
ar: العودة الى قائمة المنتجات

source: Download Sample Excel File
ar: تحميل نموذج ملف إكسل

source: Click the button below to download a sample Excel file with the correct format:
ar: انقر على الزر أدناه لتنزيل ملف تجريبي , يحتوي على عينة البيانات الصحيحة

source: Delete Product
ar: حذف المنتج

source: Are you sure you want to delete the product
ar: هل انت متأكد من حذف المنتج

source: Yes, delete
ar: نعم, حذف

source: Add / Define New Product
ar: إضافة / تعريف منتج جديد

source: Product Details
ar: تفاصيل المنتج

source: Save Product
ar: حفظ المنتج

source: Products
ar: المنتجات

source: Add / View products
ar: إضافة / عرض المنتجات

source: Import from Excel
ar: استيراد من إكسل

source: Search by name
ar: بحث بالاسم

source: Search products
ar: بحث عن المنتجات

source: Purchase Price
ar: سعر الشراء

source: Attributes
ar: الخصائص

source: No attributes
ar: لا توجد خصائص

source: No products yet
ar: لا يوجد منتجات بعد

source: The SKELETONE of our stock
ar: الهيكل العام للمخزون

source: Add New Employee
ar: الموظف

source: Add
ar: اضافة

source: Employee Information
ar: معلومات الموظف

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Date of birth
ar: تاريخ الميلاد

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Employees List
ar: الموظفون

source: Joined us at
ar: شارك معنا على

source: - Select Product -
ar: - اختر منتج -

source: Type or scan ISBN
ar: اكتب / امسح الباركود

source: Type or select a supplier
ar: اكتب او اضغط للاختيار

source: Currency
ar: العملة

source: - Select Currency -
ar: - اختر العملة -

source: Exchange rate will be applied automatically.
ar: سيتم تطبيق سعر الصرف تلقائياً.

source: Payment Method
ar: طريقة الدفع:

source: Products purchased in a currency different from the base currency are automatically converted to the base currency based on the applicable exchange rate.
ar: المنتجات المشتراة بعملة مختلفة عن العملة الأساسية يتم تحويلها تلقائياً إلى العملة الأساسية بناءً على سعر الصرف المطبق.

source: ID
ar: المعرف

source: Apply Edits
ar: تطبيق التعديلات

source: Submit order
ar: إرسال الطلب

source: Clear order
ar: مسح الطلب

source: Recent Purchases Invoices
ar: أحدث فواتير المشتريات

source: Added at
ar: أضيف في

source: Return
ar: إرجاع

source: Order No.
ar: رقم الطلب

source: Purchase
ar: شراء

source: Saving...
ar: خفظ...

source: Edits applied successfully
ar: تم تطبيق التعديلات بنجاح

source: Error applying edits
ar: خطأ في تطبيق التعديلات

source: Import Purchase Invoices from Excel
ar: استيراد المنتجات الشراء من Excel

source: Required (product must exist)
ar: مطلوب

source: Product ISBN
ar: ISBN

source: Supplier Name
ar: المورد

source: Required (will be created if doesn't exist)
ar: مطلوب (سيتم إنشاؤه إذا لم يكن موجودًا)

source: Optional (cash or debts, default: cash)
ar: اختياري (نقدي او ذمم)

source: The first row should be headers and will be skipped during import. Multiple rows with the same supplier, employee, and payment method will be grouped into a single invoice.
ar: يجب أن يحتوي الصف الأول على العناوين وسيتم تخطيه أثناء الاستيراد. سيتم تجميع الصفوف المتعددة التي تحتوي على نفس المورد والموظف وطريقة الدفع في فاتورة واحدة.

source: new Supplier will be defined if it not already defined.
ar: سيتم انشاء المورد الجديد اذا لم يكم معرفا

source: An invoice will be created for each supplier.
ar: سيتم انشاء فاتورة لكل مورد

source: The purchase price of the product will be updated according to the invoice.
ar: سيتم تحديث سعر الشراء للمنتج حسب الفاتوره

source: Import Purchase Invoices
ar: استيراد سند مشتريات

source: Back to Purchases
ar: العودة الى قائمة المشتريات

source: Purchase Return
ar: مرتجع شراء

source: Original Purchase Invoice:
ar: فاتورة الشراء الأصلية:

source: Returned Quantity
ar: الكمية المُرتجعة

source: Total Returned
ar: إجمالي المرتجع

source: Return for Purchase
ar: إرجاع عن عملية شراء

source: Purchased Quantity
ar: الكمية المشتراة

source: Allowed to Return
ar: المسموح بإرجاعه

source: Return Quantity
ar: كمية الإرجاع

source: Submit Return
ar: إرسال الإرجاع

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter Purchase Invoice Number:
ar: ادخل رقم فاتورة الشراء

source: Open Return
ar: إرجاع بيع

source: * This will Open The Purchase Invoice To Make Return Purchases
ar: * سيتم فتح الفاتوره لعمل : سند مردود مشتريات *

source: Recent Returned Invoices
ar: أحدث فواتير مرتجع مشتريات

source: Return No.
ar: إرجاع رقم

source: Enter Sale Invoice Number
ar: ادخل رقم فاتورة البيع

source: * This will Open The Sale Invoice To Make Return Sales
ar: * سيتم فتح الفاتوره لعمل : سند مردودات مبيعات *

source: Recent Sale Returns
ar: أحدث فواتير مرتجع مبيعات

source: Select or type customer
ar: حدد أو اكتب اسم العميل

source: Recent Sales Orders
ar: أحدث طلبات المبيعات

source: Sale Return
ar: إرجاع بيع

source: Original Sale Invoice:
ar: فاتورة البيع الأصلية:

source: Return for Sale
ar: إرجاع عن عملية بيع

source: Sold Quantity
ar: الكمية المباعة

source: From Date
ar: من تاريخ

source: To Date
ar: الى تاريخ

source: Generate Report
ar: انشاء التقرير

source: Returned
ar: مرجع

source: Remain Sold
ar: المباع النهائي

source: Income
ar: دخل مقبوض

source: Totals
ar: الإجمالي

source: Employee account
ar: حساب موظف

source: Manager account
ar: حساب مدير

source: You have successfully logged as Admin!
ar: تم تسجيل دخولك كمسؤول بنجاح!

source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Forgot Password?
ar: هل نسيت كلمة السر؟

source: Register with
ar: سجل بواسطة

source: Stock Out Vouchers
ar: سندات المخرجات

source: Type or select a customer
ar: اكتب او اختر عميلا

source: Recent Stock Out Invoices
ar: أحدث سندات المخرجات

source: Are you sure you want to convert this voucher to a sale?
ar: هل أنت متأكد أنك تريد تحويل هذا السند إلى فاتورة مبيعات؟

source: Convert to Sale
ar: تحويل إلى مبيعات

source: Stock Out
ar: مخرجات

source: Back
ar: رجوع

source: Print
ar: طباعة

source: Edit Stock Out Voucher
ar: تعديل سند المخرجات

source: Add Item
ar: اضافة عنصر

source: Supplier Details
ar: معلومات المورد

source: Edit Supplier
ar: تعديل المورد

source: Purchase Invoices from this supplier
ar: سندات المشتريات من هذا المورد

source: Invoice No.
ar: رقم الفاتورة:

source: No purchase invoices found for this supplier.
ar: لا توجد مشتريات من هذا المورد

source: Manage your suppliers
ar: ادارة الموردين

source: Search suppliers
ar: بحث عن المورد

source: Add Supplier
ar: اضافة المورد

source: Are you sure you want to delete this supplier?
ar: هل انت متأكد من حذف المنتج

source: No suppliers found.
ar: لا يوجد موردين

source: Save Supplier
ar: حفظ المورد

source: View Purchase Invoice
ar: عرض فاتورة شراء

source: Added by:
ar: أضيف بواسطة:

source: Print Invoice
ar: طباعة فاتورة

source: Address:
ar: العنوان:

source: Issued by:
ar: صادرة بواسطة:

source: This purchase invoice documents products purchased. Keep this invoice for your records.
ar: تُوثِّق فاتورة الشراء هذه المنتجات المشتراة. احتفظ بها لسجلاتك.

source: Printable content not found
ar: محتوى الطباعة غير موجود

source: Please allow popups for this site to print the invoice.
ar: يرجى السماح بالنوافذ المنبثقة لهذا الموقع لطباعة الفاتورة.

source: View Return Invoice
ar: عرض فاتورة الارجاع

source: This returned products invoice documents products returned to supplier. Keep this invoice for your records.
ar: هذه الفاتورة تُوثّق المنتجات المُعادة للعميل. احتفظ بها لسجلاتك

source: View Sale Return
ar: إرجاع بيع عرض

source: This returned products invoice documents products returned to customer. Keep this invoice for your records.
ar: هذه الفاتورة تُوثّق المنتجات المُعادة للعميل. احتفظ بها لسجلاتك

source: View Sale Invoice
ar: عرض فاتورة بيع

source: Products in invoice:
ar: المنتجات في الفاتورة:

source: This sales invoice documents products sold. Keep this invoice for your records.
ar: تُوثِّق فاتورة المبيعات هذه المنتجات المباعة. احتفظ بها لسجلاتك

source: First name should be at least 2 characters
ar: يجب أن يتكون الاسم الأول من حرفين على الأقل

source: Last name should be at least 2 characters
ar: يجب أن يتكون اسم العائلة من حرفين على الأقل

source: Invalid email address!
ar: عنوان البريد الإلكتروني غير صالح!

source: Please enter a date
ar: يرجى إدخال تاريخ

source: Date should be in the past
ar: يجب أن يكون التاريخ في الماضي

source: Password should be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Phone number should be at least 10 characters
ar: يجب أن 10 ارقام

source: Product name should be at least 2 characters
ar: يجب أن يتكون الاسم المنتج من حرفين على الأقل

source: Please enter a quantity
ar: يرجى إدخال الكمية

source: Please enter a purchasing price
ar: يرجى إدخال سعر الشراء

source: Please enter a product name
ar: يرجى إدخال اسم المنتج

source: Please enter a supplier
ar: يرجى إدخال المزود او الناشر

source: Choose a Product Please
ar: قم باختيار منتج من فضلك

source: ⚠️ Product not found.
ar: المنتج غير موجود

source: ⚠️ Quantity must be a number.
ar: الكمية يجب ان تكون رقم

source: ⚠️ Quantity must be greater than zero.
ar: الكمية يجب ان تكون اكبر من صفر

source: ⚠️ Out of stock.
ar: إنتهى من المخزن

source: Invalid method
ar: طريقة غير صالحة

source: No ISBN provided
ar: No ISBN

source: Product not found
ar: المنتج غير موجود

source: Cannot sell "%(product)s": out of stock.
ar: لا يمكن بيع "%(product)s": فارغ من المخزون.

source: Cannot sell more than available stock for "%(product)s".
ar: لا يمكن بيع أكثر من المخزون المتاح"%(product)s".

source: No items provided
ar: لا عناصر معطاه

source: Invalid product_id
ar: معرف الكتاب مفقود

source: Quantity must be positive
ar: الكمية يجب ان تكون موجبة

source: Incorrect Password
ar: كلمة مرور غير صحيحه

source: Email is incorrect
ar: الايميل غير صحيح

source: All fields are required
ar: جميع الحقول مطلوبة

source: New passwords do not match
ar: كلمات المرور غير متطابقة

source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

source: Incorrect old password
ar: كلمة مرور قديمة غير صحيحة

source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Email is required
ar: البريد الإلكتروني مطلوب

source: Email not found
ar: لم يتم العثور على البريد الإلكتروني

source: Password Reset Request
ar: طلب إعادة تعيين كلمة المرور

source: Click the link to reset your password:
ar: انقر على الرابط لإعادة تعيين كلمة المرور الخاصة بك:

source: Reset link sent to your email
ar: تم إرسال رابط إعادة التعيين إلى بريدك الإلكتروني

source: Failed to send email: %(error)s
ar: فشل إرسال البريد الإلكتروني: %(error)s

source: Invalid or expired token
ar: رمز غير صالح أو منتهي الصلاحية

source: Password reset successfully
ar: تمت إعادة تعيين كلمة المرور بنجاح

source: Successfully added an employee!
ar: تم ادخال موظف بنجاح

source: Successfully added a product!
ar: تم ادخال منتج بنجاح

source: Supplier name is required.
ar: اسم المورد مطلوب

source: Successfully added supplier.
ar: تم ادخال موظف بنجاح

source: Failed to add supplier: %(err)s
ar: فشل إضافة المورد: %(err)s

source: Supplier not found.
ar: المورد غير موجود

source: Supplier updated.
ar: تحديث معلومات المورد

source: Supplier deleted.
ar: تم حذف المورد

source: Failed to delete supplier: %(err)s
ar: فشل حذف المورد: %(err)s

source: Customer name is required.
ar: اسم العميل مطلوب

source: Successfully added customer.
ar: تم ادخال العميل بنجاح

source: Failed to add customer: %(err)s
ar: فشل إضافة العميل: %(err)s

source: Customer not found.
ar: العميل غير موجود

source: Customer updated successfully.
ar: تم تعديل العميل بنجاح

source: Customer deleted successfully.
ar: تم حذف العميل بنجاح

source: Failed to delete customer.
ar: فشل حذف العميل

source: Product name and positive quantity are required.
ar: المنتج والكمية مطلوبان !

source: Cannot sell more than available stock for "%(product)s". Available: %(available)d, requested total: %(total)d
ar: لا يمكن بيع كمية أكبر من المخزون المتاح للمنتج "%(product)s". المتاح: %(available)d، الكمية المطلوبة الإجمالية: %(total)d

source: Please add at least one product to sale!
ar: ادخل منتج واحد على الاقل للبيع

source: Could not set exchange rate: %(err)s
ar: تعذّر تعيين سعر الصرف: %(err)s

source: Successfully Sold!
ar: تم البيع

source: Cannot sell more than available stock for "%(product)s". Available: %(available)d, requested: %(requested)d
ar: لا يمكن بيع كمية أكبر من المخزون المتاح للمنتج "%(product)s". المتاح: %(available)d، المطلوب: %(requested)d

source: Please sign in to create a return.
ar: يرجى تسجيل الدخول لإنشاء طلب إرجاع.

source: Sale order not found.
ar: سند البيع غير موجود

source: Cannot return %(qty)d of %(product)s; only %(allowed)d available to return.
ar: لا يمكن ارجاع %(qty)d من %(product)s; فقط %(allowed)d متوفر للارجاع.

source: Please enter at least one quantity to return.
ar: ادخل كمية للارجاع

source: Sale return recorded.
ar: تسجيل إرجاع مبيعات

source: Sale return not found.
ar: سند الإرجاع غير موجود

source: Purchase not found.
ar: سند الشراء غير موجود

source: Purchase return recorded.
ar: تسجيل مرتجع شراء

source: Return not found.
ar: إرجاع غير موجود

source: Please add at least one product to purchase!
ar: ادخل منتج على الاقل للشراء

source: Please select a currency before submitting the purchase!
ar: يُرجى تحديد العملة قبل تقديم طلب الشراء.

source: Updated purchasing price for product '%(prod)s' to %(price).2f in base currency.
ar: تم تحديث سعر الشراء للمنتج '%(prod)s' إلى %(price).2f بالعملة الأساسية.

source: Could not Convert : %(err)s
ar: تعذّر التحويل: %(err)s

source: Could not update purchase totals: %(err)s
ar: تعذّر تحديث إجماليات المشتريات: %(err)s

source: Purchased Successfully!
ar: تم الشراء بنجاح

source: already empty!
ar: فارخ مسبقا

source: Please add at least one product to return!
ar: ادخل منتج للارجاع

source: Return Recorded Successfully!
ar: تم لارجاع بنجاح

source: Voucher not found.
ar: سند غير موجود

source: Company name is required.
ar: اسم الشركة مطلوب.

source: Company profile saved.
ar: تم حفظ ملف تعريف الشركة.

source: Failed to save company profile: %(err)s
ar: فشل حفظ ملف تعريف الشركة: %(err)s

source: Currency code and name are required.
ar: اسم ورمز العملة مطلوبان.

source: Currency with code %(code)s already exists.
ar: العملة بالرمز %(code)s موجودة مسبقًا.

source: Currency added successfully.
ar: تمت إضافة العملة بنجاح.
